# 32 Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.

li = [1, 2, 3, 2, 3, 4, 3, 4, 5]
res = list(set(li))
print(res)